Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །གལ་ཏེ་རིས་འཐུན་པར་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པའི་དགེ་བའི་རྩ་བ་བསགས་པར་གྱུར་པ་ཞིག་ན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་དེ་བཞིན་གཤེགས་པ་ལ་སུས་ནམ་མཁའ་ཀུན་ཏུ་སྐྱེད། གང་དུ་དེ་ཡོངས་སུ་ཟད་པར་འགྱུར་བ་བདག་གིས་ཞུ་གོར་མ་ཆག་སྙམ་མོ། །དེ་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པ་ལ་བདག་གིས་ཞུས་ཟིན་ནོ་སྙམ་ཡང་སེམས་སོ། །དེ་བཞིན་གཤེགས་པ་ཡང་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ནམ་མཁའ་རྟོག་པར་གསུངས་པ་སྟེ། །རྟོག་པ་དེ་ནི་ཡོད་མ་ཡིན། །
en: “If, in accordance with their class, they have accumulated roots of virtue that accord with the aspect of certainty, they will wonder, ‘I must definitely ask the Thus-Gone One about who created space and where it will be exhausted!’ They will then think, ‘I have already asked the Thus-Gone One this.’ The Thus-Gone One will tell them, ‘Space is a verbal concept, and that concept is nonexistent.

source: ནམ་མཁའི་མིང་དང་རྟོག་པ་དག །དེ་དག་ཐམས་ཅད་དངོས་པོ་མེད།
en: The term space and all other concepts are insubstantial.

source: །ཆོས་རྣམས་ཐམས་ཅད་ཅི་ཡང་མེད། །འགྱུར་བ་མེད་ཅིང་མཚན་ཉིད་མེད།
en: All phenomena are utterly nonexistent, unchanging, and devoid of characteristics.

source: །མཚན་ཉིད་མེད་པར་བརྟགས་པ་ཡིས། །མཚན་གཞི་ཀུན་ལས་རབ་ཏུ་གྲོལ། །བསྟན་པ་དེ་ཐོས་ནས་མྱུར་དུ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འཐོབ་བོ། །དེའི་གཟུགས་ཀྱི་འདོད་ཆགས་འདོད་པ་རྣམས་ནི་ལྷག་མ་མ་ལུས་པར་འགྱུར་རོ།
en: By investigating them from the perspective of the absence of characteristics, one becomes completely free from the basis of those characteristics.’ Upon hearing that teaching, they will then swiftly attain the fruition of nonreturners, and all their desires and attachments related to the form realm will disappear without remainder.

source: །དེ་བཞིན་དུ་གཟུགས་མེད་པའི་འདོད་ཆགས་དང་། མ་རིག་པ་དང་། ང་རྒྱལ་དང་། རྒོད་པ་ལྷག་མ་མ་ལུས་པར་འགྱུར་རོ།
en: Likewise, all their attachments related to the formless realm, their ignorance, their pride, and their agitation will also disappear without remainder.

source: །ཡང་སུ་ལ་རིས་འཐུན་པར་ངེས་པར་འབྱེད་པའི་ཆ་དང་འཐུན་པའི་དགེ་བའི་རྩ་བ་རྣམས་མེད་པ་དེ། གལ་ཏེ་སངས་རྒྱས་ཀྱི་སྐུ་མཐོང་ན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་དེ་བཞིན་གཤེགས་པའི་ཚད་བདག་གིས་གཟུང་བ་གོར་མ་ཆག་སྙམ་མོ། །
en: “If those who, in accordance with their class, lack the roots of virtue that accord with the aspect of certainty see the body of the Buddha, they will think, ‘I am truly apprehending the size of the Thus-Gone One.’ When they look in all directions, they will see the Thus-Gone One everywhere throughout all of space.

source: དེ་གལ་ཏེ་ཕྱོགས་ཐམས་ཅད་དུ་ལྟ་བར་བྱེད་ན་ཐམས་ཅད་དུ་ནམ་མཁའ་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འགྱུར་ཏེ། ཆུང་ངུར་ལྟ་བར་བྱེད་ན་དེ་བཞིན་གཤེགས་པ་ཆུང་ངུ་ཉིད་དུ་མཐོང་ངོ་། །ཚད་མེད་པར་ལྟ་བར་བྱེད་ན་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པར་མཐོང་ངོ་། །
en: If they view the Thus-Gone One as being small, they will perceive him as being small. If they view him as being immeasurable, they will perceive him as being immeasurable.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་འདི་ག་ལས་གཤེགས་སྙམ་མོ། །
en: However, they will then think, ‘Where does the Thus-Gone One come from?

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་འདི་ག་ལས་ཀྱང་མ་གཤེགས་སོ། །གང་དུ་ཡང་མ་བཞུད་དོ།
en: The Thus-Gone One does not come from anywhere and does not go anywhere.

source: །དེ་གང་དུ་ཡང་དེ་བཞིན་གཤེགས་པ་བཞུད་པ་མི་དམིགས། བྱོན་པ་མི་དམིགས་སོ། །
en: No place can be found where the Thus-Gone One goes to or comes from!

source: ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ལུས་ཀྱི་རྒྱུ་ཁམས་གསུམ་པ་འདི་ནི་སེམས་ཙམ་པས། སུས་ཇི་ལྟར་རྣམ་པར་བརྟགས་པ་དེ་བཞིན་དུ་མཐོང་ངོ་།
en: Since the body and the three realms are caused by the mind alone, beings perceive in accordance with their concepts.

source: །བདག་གིས་རང་གི་སེམས་ཀྱིས་སངས་རྒྱས་སུ་བྱེད་དོ།
en: I create the Buddha with my own mind.

source: །བདག་གི་སེམས་ཀྱིས་སངས་རྒྱས་མཐོང་ངོ་།
en: I see the Buddha through my mind.

source: །བདག་གི་སེམས་ཉིད་སངས་རྒྱས་སོ། །བདག་གི་སེམས་ཉིད་ལུས་སོ། །སེམས་ཉིད་ཀྱང་ནམ་མཁའོ།
en: My mind itself is the Buddha, my mind itself is the body, and my mind itself is space.

source: །བདག་གི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པས་སངས་རྒྱས་མཐོང་ངོ་།
en: I perceive the Buddha through the concepts of my own mind.

source: །སེམས་ཀྱིས་སེམས་མི་ཤེས་སོ།
en: The mind does not cognize the mind.

source: །སེམས་ཀྱིས་སེམས་མི་མཐོང་ངོ་།
en: The mind does not see the mind.

source: །སེམས་སུ་འདུ་ཤེས་པ་རྣམས་ནི་ཤེས་པ་མེད་པའོ།
en: Mental perceptions are devoid of cognition.

source: །སེམས་སུ་འདུ་ཤེས་པ་རྣམས་ནི་ལྡོག་པའོ། །ལྡོག་པ་ནི་སྙིང་པོ་མེད་པའོ།
en: Mental perceptions are negations, and negations are insubstantial.

source: །ཆོས་དེ་དག་ནི་ཤེས་པ་མེད་པའི་ཕྱིར་ཡང་དག་པར་བྱུང་བའོ།
en: Those phenomena only manifest because they are devoid of cognition.’

source: །སུས་སྔོན་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་ཤེས་རབ་གང་གིས་སྟོང་པར་རྟོགས་པ་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་པའོ་སྙམ་ནས་དམིགས་པ་ཡིད་ལ་བྱེད་པ་དེས་ད་ལྟར་གྱི་སངས་རྒྱས་མངོན་དུ་བཞུགས་པའི་ཏིང་ངེ་འཛིན་འཐོབ་བོ།
en: “Those who have previously given rise to the mind set on awakening and realized emptiness through insight will then contemplate objects while contemplating their intrinsic emptiness. They will attain the absorption in which the present buddhas are dwelling.

source: །འོན་ཀྱང་ཡང་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་ཡིན་ཏེ།
en: Even so, they are followers of the hearers’ vehicle.

source: དེ་ལྟར་མཚན་མ་མེད་པའི་གཟུགས་ཐམས་ཅད་རྣམ་པར་བསྒོམས་པས་ངེས་པར་འབྱེད་པ་ཡོངས་སུ་དག་པ་ཡིན། འདོད་ཆགས་དང་བྲལ་བ་ཡོངས་སུ་དག་པ་ཡིན། མ་རིག་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ།
en: Since they have become accustomed to all forms being devoid of marks, their insight, their freedom from attachment, and their ignorance are purified.

source: །དེ་ལ་སྟོང་པ་ཉིད་ཀྱི་བསམ་པས་ནི་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་རྣོན་པོ་འཐོབ་སྟེ། ཕྱིས་ཀྱང་དེའི་འབྲས་བུ་འཐོབ་པར་དཀའ་བ་མེད་དོ།
en: By contemplating emptiness, they will attain the keen acceptance that accords with emptiness, and later on they will achieve its fruition without difficulty.

source: །གལ་ཏེ་ཡང་ནམ་མཁའ་སྟོང་པ་ལ་རྣམ་པར་སྒོམ་པར་བྱེད་ན་ལུས་ཤིན་ཏུ་སྦྱངས་པ་ཡིན། སེམས་ཤིན་ཏུ་སྦྱངས་པ་ཡིན་ཏེ།
en: If they meditate on empty space, their bodies and minds will be utterly purified.

source: དེར་སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་ཐར་པའི་སྒོ་འཐོབ་བོ། །དེའི་འབྲས་བུ་རྗེས་སུ་འཐོབ་པར་དཀའ་བ་ཡང་མེད་དེ་འདི་ནི་སྟོང་པ་ཉིད་ལ་རབ་ཏུ་བརྩོན་པ།
en: They will reach the gateway of liberation of emptiness, and they will achieve that fruition without difficulty.

source: འགོག་པ་ལ་དམིགས་པའི་ཉོན་མོངས་པའི་རྦ་རླབས་རྣམ་པར་གཅོད་པའི་ཆོས་ཀྱི་སྒོ་ལྔ་པའོ།
en: This the fifth Dharma gateway, which strives in emptiness, focuses on cessation, and interrupts the waves of afflictions.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་པ་འདི་བཤད་པ་ན་འཁོར་དེ་ལས་ལྷ་དང་མི་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་ནི་དེ་བཞིན་དུ་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ནི་དེར་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: As this teaching was being given by the Blessed One, ninety-nine trillion gods and humans from that retinue achieved the concordant acceptance, and eighty-four thousand of them achieved the acceptance that accords with emptiness.

source: །དེ་བཞིན་དུ་སྲོག་ཆགས་སྟོང་ཕྲག་དྲུག་ཅུ་ནི་དེར་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་ཐར་པའི་སྒོ་ཐོབ་པར་གྱུར་ཏོ། །སྲོག་ཆགས་སྟོང་ཕྲག་ཉི་ཤུ་ནི་དེར་ད་ལྟར་གྱི་སངས་རྒྱས་མངོན་དུ་བཞུགས་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཏོ།
en: Similarly, sixty thousand beings reached the gateway of liberation of the absorption of emptiness, and twenty thousand of them achieved the absorption in which the present buddhas are dwelling.

source: །སེམས་ཅན་དཔག་ཏུ་མེད་པས་ཀྱང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ། །དགེ་སློང་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཡང་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།
en: Countless sentient beings also achieved the fruition of the stream enterers, and the minds of eighty-four thousand monks were liberated from their defilements with no further grasping.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཌི་ནྱ་གཞན་ཡང་སུ་མགོའི་ཐོད་པ་དེ་ལ་སེམས་ཡང་དག་པར་གནས་པར་མི་བྱེད་ཅིང་རབ་ཏུ་དད་པར་མི་བྱེད། མོས་པར་མི་བྱེད་པ་དེས་ཀྱང་དུར་ཁྲོད་དུ་འགྲོ་བར་བྱའོ།
en: The Blessed One then said, “Furthermore, Kauṇḍinya, those who do not dwell mentally on that contemplation of the skull, who have no faith in it, and who are not inspired by it should go to a charnel ground.

source: །དེས་དེར་མི་རོ་རྣམ་པ་སྣ་ཚོགས་པ་མཐོང་ཞིང་ཁ་ཅིག་ནི་རྣམ་པར་སྔོས་པ། ཁ་ཅིག་ནི་རྣམ་པར་རྣགས་པ། ཁ་ཅིག་ནི་རྣམ་པར་དམར་བ། ཁ་ཅིག་ནི་རྣམ་པར་ཟོས་པ་དང་། བམ་པ་དང་། ཤ་ཁྲག་མེད་པ་དང་། དཀར་ཞིང་རབ་ཏུ་དཀར་ལ་དུང་གི་མདོག་ལྟ་བུའི་རུས་གོང་དུ་མཐོང་བར་འགྱུར་རོ།
en: There they will see a variety of human corpses—some bluish, some festering, some bloody, some being devoured, some decomposed, some without flesh and blood, and some as bare bones completely white like conch shells.

source: །དེ་ཐམས་ཅད་ལ་ཡང་དང་ཡང་དུ་སོ་སོར་བརྟག་པར་བྱ་སྟེ།
en: They should examine all these corpses repeatedly.

source: གང་དང་གང་དུ་དེའི་སེམས་ཤིན་ཏུ་ཡང་དག་པར་གནས་ཤིང་མི་གཡོ་ལ། རྣམ་པར་གཡེང་བར་མི་འགྱུར་བ་དེ་ཡིད་ཀྱིས་བཟུང་ནས་ཡིད་ལ་བྱ་ཞིང་བསྒོམ་པར་བྱས་ན་ཟག་པ་ཐམས་ཅད་ཟད་པར་འགྱུར་བའི་བར་དུ་ཐམས་ཅད་འགྱུར་རོ།
en: If they contemplate those objects, keep them in mind, and meditate on them with quiet minds, without wavering or being distracted, they will experience everything up to the exhaustion of all their defilements.

source: །སེམས་ཅན་སུ་ལྷག་པའི་ང་རྒྱལ་ཅན་ཡིན་པ་དེས་ནི་ཤི་ནས་རིང་པོ་མ་ལོན་པའི་མི་རོ་རྣམ་པར་སྔོས་པ་དག་ཚུལ་བཞིན་དུ་བཟུང་ནས་ཡིད་ལ་བྱ། བྱིན་གྱིས་བརླབ་པར་བྱ། བསྒོམ་པར་བྱའོ།
en: “Sentient beings with overweening pride should contemplate, visualize, and meditate on human corpses that become bluish shortly after death.

source: །ཇི་ལྟར་ཡིད་ལ་བྱས་པ་དེ་ལྟར་བདག་གི་ལུས་ལ་ཡང་དག་པར་མཐོང་བར་འགྱུར་རོ། །འདི་ལ་བྱེ་བྲག་ཅི་ཡོད་དེ། ཇི་ལྟར་དེ་རྣམ་པར་སྔོས་པའམ།
en: They will then perceive their own bodies in the same way they perceive the corpses they have contemplated. They will see that their own bodies are the same as the corpses of others—they are not different from bluish and festering corpses.

source: རྣམ་པར་རྣགས་པ་དེ་བཞིན་དུ་བྱེ་བྲག་མེད་པར་བདག་གི་ལུས་ཀྱང་གཞན་གྱི་ལུས་ཀྱི་རོ་དང་མཚུངས་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ཞིང་དེ་བདག་གི་ལུས་དེ་ལ་སྒོམ་པའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པས་གནས་སོ་ཞེས་བྱ་བ་ནས་ལུས་འདི་ཐམས་ཅད་རྣགས་པའི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །རྣམ་པར་དམར་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་། །སྲིན་བུའི་རིགས་རྣམས་ཀྱིས་ལྟོ་གང་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: By maintaining their efforts in applying this meditation to their own bodies, they will perceive their bodies entirely festering and bloody, their bellies infested by maggots.

source: །རང་གི་ལུས་རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པ་སྲིན་བུའི་རིགས་རྣམས་ཀྱིས་གང་ཞིང་ཟ་བར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་ཞེས་བྱ་བ་ནས་ཤ་ཁྲག་མེད་པ་དང་། དཀར་ཞིང་རབ་ཏུ་དཀར་ལ་དུང་གི་མདོག་ལྟ་བུའི་རུས་གོང་དང་། རུས་པའི་ཕུང་པོ་རྒྱུས་པ་དང་འབྲེལ་བའི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་སྟེ།
en: They will see their bodies entirely infested and devoured by maggots, up until the stages where they are without flesh and blood and become bare bones completely white like conch shells, heaps of bones connected with ligaments.

source: དེ་ཡིད་ལ་བྱེད་ཅིང་དེ་ལ་བྱིན་གྱིས་རློབ་པར་བྱེད། དེ་ལ་སྒོམ་པར་བྱེད་དོ།
en: This is what they should focus on, build up, and cultivate.

source: །ཉིན་པར་ཇི་ལྟ་བར་མཚན་མོ་ཡང་དེ་བཞིན་ནོ། །མཚན་མོ་ཇི་ལྟ་བར་ཉིན་པར་ཡང་དེ་བཞིན་ཏེ། འགྲོ་བ་དང་། འགྲེང་བ་དང་། འདུག་པ་དང་། ཉལ་བ་ན་རང་གི་ལུས་དེ་ཡང་རུས་གོང་གི་ཕུང་པོ་དཀར་ཞིང་རབ་ཏུ་དཀར་ལ་དུང་གི་མདོག་ལྟ་བུ་དང་། རྒྱུས་པ་དང་། པགས་ཤུན་དང་འབྲེལ་བར་ཡིད་ལ་བྱེད་ཅིང་བྱིན་གྱིས་རློབ་པར་བྱེད་ཅིང་སྒོམ་པར་བྱེད་དེ།
en: Day and night, whether they are walking, standing, sitting, or lying down, they should contemplate, visualize, and meditate on their own bodies as heaps of bones completely white like conch shells and connected with ligaments and skin.

source: དཔེར་ན་མིག་བཙུམས་པས་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་བཞིན་ནོ།
en: They will be able to perceive this in the blink of an eye.

source: །ཇི་ལྟར་བདག་གི་ལུས་ལ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དེ་བཞིན་དུ་གང་དང་གང་དུ་ལྟ་བར་བྱེད་པ་སའི་རྣམ་པ་དང་། ཤིང་དང་། མི་དང་། དུད་འགྲོའི་སྐྱེ་གནས་པ་གང་ཅི་མཐོང་བ་ཐམས་ཅད་དུ་རུས་པའི་ཕུང་པོ་དཀར་ཞིང་རབ་ཏུ་དཀར་ལ་དུང་གི་མདོག་ལྟ་བུ་དང་། རྒྱུས་པ་དང་འབྲེལ་བ་དེ་ལྟ་བུར་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: Just as they perceive their own bodies, wherever they look—whether at the earth, trees, humans, or animals—they will see heaps of bones completely white like conch shells and connected with ligaments.

source: །གང་དུ་ཆགས་པར་བྱེད་ཅིང་འགྲོ་བར་བྱེད་པ་ཐམས་ཅད་དེ་རུས་པའི་ཕུང་པོ་ལ་རྐང་པ་གཉིས་ཀྱིས་འགྲོ་ཞིང་ལྡོག་པས་རུས་པའི་ཕུང་པོ་ལ་གནོན་པར་བྱེད་ཅིང་འདུག་པར་བྱེད།
en: Wherever they walk and travel, they will tread on and sidestep heaps of bones.

source: ཉལ་བར་བྱེད་དེ། དཔེར་ན་དེའི་མི་སྡུག་པའི་འདུ་ཤེས་ཤིན་ཏུ་བསྒོམས་ཤིང་ཤིན་ཏུ་ཡིད་ལ་བྱས་ལ། ཤིན་ཏུ་ནན་ཏན་བྱས་པ་བཞིན་ནོ།
en: They will trample on heaps of bones, sit on them, and sleep on them, just like those who have cultivated, focused on, and exerted themselves in the perception of repulsiveness.

source: །དེའི་རིས་འཐུན་པས་འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་སྤངས་པར་འགྱུར་ཏེ། རིས་འཐུན་པ་གཞན་ལ་མ་ཡིན་ནོ།
en: They will abandon all forms of attachment related to the desire realm, in accordance with their class but not otherwise.

source: །འདི་ནི་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཡིན་ཏེ།
en: “This is the dhāraṇī mantra that accords with emptiness.

source: དེ་ནི་ཡང་ཕྱོགས་བཞིའི་རླུང་འདུས་ནས་རུས་པའི་ཕུང་པོ་མ་ལུས་པར་རྣམ་པར་ཕྱེ་མར་བྱེད་དོ། །རྣམ་པར་འཇིག་པར་བྱེད་དོ།
en: It gathers the winds from the four directions that pulverize the heaps of bones into dust and disintegrate them.

source: །ཇི་ལྟར་རང་གི་ལུས་ཀྱི་རུས་པའི་ཕུང་པོ་ལ་རླུང་འདུས་ནས་མ་ལུས་པར་རྣམ་པར་ཕྱེ་མར་བྱེད་ཅིང་རྣམ་པར་འཇིག་པར་བྱེད་པ་དེ་བཞིན་དུ་རླུང་འདུས་ནས་གཟུགས་ཀྱི་ལུས་ཐམས་ཅད་དང་། ས་ཐམས་ཅད་མ་ལུས་པར་ཕྱེ་མར་བྱེད་ཅིང་རྣམ་པར་འཇིག་པར་བྱེད་དོ་ཞེས་བྱ་བ་ནས་བདག་གམ་གཞན་ཡང་རུང་དེའི་མིག་སྔར་གཟུགས་སུ་སྣང་བ་ཅི་ཡང་མི་འབྱུང་སྟེ།
en: Just as it gathers the winds that pulverize the heaps of bones of their own bodies into dust and disintegrate them, it also gathers the winds that pulverize all bodies and this entire earth into dust and disintegrate them to the point that material form will no longer appear before theirs or others’ eyes.

source: ནམ་མཁའ་བཻ་དཱུརྱ་ལྟ་བུར་སྟོང་པར་བརྗོད་པར་བྱ་བ་ལ་མོས་པར་བྱེད་ཅིང་ནམ་མཁའ་ལ་བྱིན་གྱིས་རློབ་པར་བྱེད། སྒོམ་པར་བྱེད། ལན་མང་དུ་བྱེད་དོ།
en: “Those beings will then focus on the empty, beryl-like space. They will visualize space, meditate on it, and repeat that process many times.

source: །ཇི་ལྟར་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ཡང་དཔྱོད་པར་བྱ་བའི་ཕྱིར་ནམ་མཁའི་ཁ་དོག་སེར་པོ་ཡིད་ལ་བྱེད་ཅིང་ཁ་དོག་སེར་པོར་རབ་ཏུ་སྦྱོར་བར་བྱེད། བྱིན་གྱིས་རློབ་པར་བྱེད།
en: They will think, ‘Furthermore, for the sake of investigation, I will contemplate the sky as being yellow.

source: སྒོམ་པར་བྱེད་པ་དེ་བཞིན་དུ་ནམ་མཁའ་ཐམས་ཅད་སེར་པོར་མོས་པར་བྱེད་དོ། །ཁ་དོག་སེར་པོ་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཁ་དོག་དམར་པོ་དང་།
en: I will envisage the sky to be yellow, visualize that, and meditate on it.’ In that way, they will imagine that the entire sky is yellow.

source: དེ་བཞིན་དུ་ཁ་དོག་དཀར་པོ་དང་། བཙོད་ཀ་ཞེས་བྱ་བ་ནས་ཤེལ་གྱི་ཁ་དོག་གི་བར་ལ་མོས་པར་བྱེད་དོ།
en: In the same way, they will imagine that its color is red, white, crimson, and every other color up to crystalline.

source: །དེ་བཞིན་དུ་ཡང་གཟུགས་སུ་སྣང་བ་དང་། ས་ཐམས་ཅད་ལ་ཆུ་ཁ་དོག་སྔོན་པོར་བྱིན་གྱིས་རློབ་པར་བྱེད་ལ་ཞེས་བྱ་བ་ནས། ཁ་དོག་སྔོན་པོར་མོས་པར་བྱེད་དོ་ཞེས་བྱ་བའི་བར་དང་།
en: Similarly, they will visualize all material appearances and the entire earth as blue water, thereby imagining these to be blue.

source: དེ་བཞིན་དུ་ཁ་དོག་སེར་པོ་ལ་ཞེས་བྱ་བ་ནས་ཁ་དོག་དམར་པོ་དང་། དེ་བཞིན་དུ་ཁ་དོག་དཀར་པོ་དང་། དེ་བཞིན་དུ་ཁ་དོག་ལེ་བརྒན་དང་། དེ་བཞིན་དུ་ཤེལ་གྱི་ཁ་དོག་གི་བར་དུ་ས་ཐམས་ཅད་ལ་ཆུར་ཡིད་ལ་བྱེད་དོ། །ཡང་དག་པར་རབ་ཏུ་ཤེས་སོ། །རབ་ཏུ་སྦྱོར་བར་བྱེད་དོ།
en: They will also contemplate, cognize, and envisage the entire earth as being water with colors ranging from yellow to red, white, violet, and crystalline.

source: །སའི་ཁམས་ཐམས་ཅད་ལ་ཆུ་ཤེལ་གྱི་ཁ་དོག་ལྟ་བུར་བྱིན་གྱིས་རློབ་པར་བྱེད་ཅིང་ཕྱིས་ཀྱང་ས་སོར་བཞི་ཙམ་དུ་བྱིན་གྱིས་རློབ་པར་བྱེད་དོ།
en: They will then visualize the entire earth element as crystalline, and after that, they will visualize that it is reduced to the size of about four fingers.

source: །དེས་རྐང་པའི་མཐེ་བོས་རེག་པར་བྱེད་ཅིང་གང་འདོད་པ་གཡོ་བར་བྱེད། རབ་ཏུ་གཡོ་བར་བྱེད། འགུལ་བར་བྱེད། ཀུན་ཏུ་རབ་ཏུ་འགུལ་བར་བྱེད་པ་ནས་གང་འདོད་པ་དང་། ཇི་ཙམ་དུ་འདོད་པ་དེ་ཙམ་དུ་རབ་ཏུ་གཡོ་བར་བྱེད་དོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: Then, they will hit it with their toes and make it shake, rock, quiver, and quake as they please—they will shake it in any way they want.

source: །དེ་འགུལ་བར་བྱེད་པ་ན་ཡང་ས་ཆེན་པོ་རི་དང་བཅས་པ་འདི་འགུལ། གཡོ། འཁྲུག །རབ་ཏུ་ལྡེག་གོ།
en: When they shake it, this great earth with its mountains will quiver, wobble, shake, and quake.

source: །གཞན་ཡང་ཆུ་དེ་ལ་ཁ་དོག་སྣ་ཚོགས་པའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ཏ་དང་། པད་མ་དཀར་པོ་རྣམས་ཡིད་ལ་བྱེད་དོ། །ཡང་དག་པར་ཤེས་སོ། །རབ་ཏུ་སྦྱོར་བར་བྱེད་དོ། །བྱིན་གྱིས་རློབ་པར་བྱེད་དོ། །ཕྱོགས་བཞིར་སེར་བུ་བསིལ་བ་རབ་ཏུ་དད་པ་དག་ཏུ་མོས་པར་བྱེད་དོ། །དེ་དེར་འཆག་པར་བྱེད། འདུག་པར་བྱེད། ཉལ་བར་ཡང་བྱེད་དོ།
en: “They will also contemplate, cognize, envisage, and visualize blue, pink, red, and white lotus flowers on that water, and they will clearly imagine fresh breezes blowing in the four directions. They will then walk, sit, and lie down on these flowers.

source: །ཡང་ཕྱོགས་བཞིར་ཁ་དོག་སྣ་ཚོགས་པའི་རི་ཆེན་པོ་རྣམས་སུ་བྱིན་གྱིས་རློབ་པར་བྱེད་ཅིང་། དེའི་སྟེང་དུ་འཆག་པར་བྱེད། གནས་པར་བྱེད། འདུག་པར་བྱེད། ཉལ་བར་ཡང་བྱེད་དོ། །
en: They will also visualize, in the four directions, great mountains of various colors, on top of which they will walk, rest, sit, and lie down.

source: གཞན་ཡང་དེ་སྤོང་བར་བྱེད་ཅིང་། ནམ་མཁའ་དག་པ་དེ་ཉིད་ཡིད་ལ་བྱེད་དོ། །ཡང་དག་པར་ཡིད་ལ་བྱེད་དོ། །ཡང་དག་པར་ཤེས་སོ། །རབ་ཏུ་སྦྱོར་བར་བྱེད་དོ། །ནམ་མཁའ་དག་པར་བྱིན་གྱིས་རློབ་པར་བྱེད་དོ།
en: Then, interrupting that process, they will contemplate, consider, cognize, envisage, and visualize these mountains to be pure space.

source: །རང་གི་ལུས་ཡང་བར་ཡིད་ལ་བྱེད་དོ། །ཡང་བར་རབ་ཏུ་སྦྱོར་བར་བྱེད་དོ། །ཡང་བར་བྱིན་གྱིས་རློབ་པར་བྱེད་དེ། དཔེར་ན་ཤིང་བལ་གྱི་འདབ་མའམ་རས་བལ་གྱི་འདབ་མ་རླུང་ཆུང་ངུས་འདེགས་པར་བྱེད། འཇོག་པར་བྱེད།
en: Next they will contemplate, envisage, and visualize their bodies to be light—just like a piece of cotton wool that is fluttering in the breeze and carried off by a gentle wind.

source: ཁྱེར་བར་བྱེད་པ་དེ་བཞིན་དུ་དེ་ལུས་འདི་ཉིད་ལ་ཡང་བར་ཡིད་ལ་བྱེད་དོ་ཞེས་བྱ་བ་ནས་ཡང་བར་བྱིན་གྱིས་རློབ་པར་བྱེད་དོ་ཞེས་བྱ་བའི་བར་དང་། རླུང་དང་ཕྲད་ནས་ནམ་མཁའ་ལ་གནས་པའི་བར་དུ་ཡིན་ཏེ། དེ་ནམ་མཁའ་ལ་འཆག་པར་བྱེད། འདུག་པར་བྱེད། གནས་པར་བྱེད། ཉལ་བར་ཡང་བྱེད་དོ།
en: They will contemplate and visualize the lightness of their bodies to the point at which as they are carried by the wind they dwell in midair, where they will then walk, sit, rest, and lie down.

source: །མེའི་ཁམས་ལ་སྙོམས་པར་འཇུག་པར་བྱེད་དེ། དེའི་ལུས་ལས་འོད་འཕྲོ་བ་ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་གྱི་ཁ་དོག་ལྟ་བུ་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་འབྱུང་བར་བྱེད་དོ།
en: Next they will rest in absorption on the fire element and radiate various blue, yellow, red, violet, and crystalline lights from their bodies.

source: །དེའི་ལུས་ཀྱི་སྟོད་ནས་མེ་འབར་བར་བྱེད་ཅིང་། ལུས་ཀྱི་སྨད་ནས་ཆུ་གྲང་མོའི་རྒྱུན་དག་འབབ་པར་བྱེད་རབ་ཏུ་འབབ་པར་བྱེད་དོ།
en: They will emit blazing fire from the upper parts of their bodies and shower down streams of cold water from their lower parts.

source: །ལུས་ཀྱི་སྨད་ནས་མེ་འབར་བར་བྱེད་ཅིང་། ལུས་ཀྱི་སྟོད་ནས་ཆུ་གྲང་མོའི་རྒྱུན་དག་འབབ་པར་བྱེད། རབ་ཏུ་འབབ་པར་བྱེད་དོ། །
en: At other times they will emit blazing fire from the lower parts of their bodies and shower down rains of cold water from the upper parts of their bodies.

source: དེ་བཞིན་དུ་སའི་སྟེང་དུ་འབྱུང་བར་ཡང་བྱེད་པ་ནས་ཉི་མ་དང་ཟླ་བ་དག་ལ་ཡང་ལག་པས་ཉུག་པར་བྱེད་དོ་ཞེས་བྱ་བའི་བར་དང་། ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ལུས་ཀྱིས་དབང་སྒྱུར་བར་བྱེད་དོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: “Likewise, they will manifest themselves on top of the earth, caress the sun and the moon with their hands, and physically exert their influence up to the world of Brahmā.

source: །དེ་ཉིད་སྤངས་ཏེ་ཡང་གཟུགས་ཅི་འདྲ་བ་དང་ཇི་སྙེད་པ་ཡང་ན་ནི་སྔོན་པོ་དང་། ཡང་ན་ནི་སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཡང་ན་ནི་ཤེལ་གྱི་ཁ་དོག་ལྟ་བུར་ཡིད་ལ་བྱེད་ཅིང་དེ་འདྲ་བ་དང་དེ་སྙེད་ཁོ་ན་མཐོང་བར་བྱེད་དོ།
en: Interrupting that process, they will then contemplate and visualize forms in any number and color they might think of, such as blue, yellow, red, white, violet, or crystalline.

source: །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཉིད་ལ་བལྟའོ་སྙམ་ན་དེས་དེ་བཞིན་གཤེགས་པ་ཉིད་མཐོང་ངོ་།
en: If they think, ‘I am looking at the Thus-Gone One,’ they will see the Thus-Gone One.

source: །དེས་ཕྱོགས་གང་དང་གང་ཁོ་ནར་ལྟ་བར་བྱེད་པའི་ཕྱོགས་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་མཐོང་ངོ་།
en: Wherever they look, they will see the Thus-Gone One.

source: །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཆུང་ངུ་ཡིད་ལ་བྱས་ན་ཆུང་ངུ་ཉིད་མཐོང་ངོ་།
en: If they think that the Thus-Gone One’s body is small, they will perceive him as being small.

source: །གལ་ཏེ་ཚད་མེད་པ་ཡིད་ལ་བྱས་ན་ཞེས་བྱ་བ་ནས་ནམ་མཁའ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་འབའ་ཞིག་མཐོང་ངོ་ཞེས་བྱ་བའི་བར་དང་། དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: If they think that it is immeasurable, [. . .] they will see the Thus-Gone One as filling the entire sky.

source: གང་དུ་ཡང་དེ་བཞིན་གཤེགས་པ་བྱོན་པའམ་བཞུད་པ་མེད་དོ་ཞེས་བྱ་བའི་བར་དང་། ཁམས་གསུམ་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་རྒྱུ་ནི་སེམས་འབའ་ཞིག་གོ་ཞེས་བྱ་བ་དང་། ཇི་ལྟར་རྣམ་པར་བརྟགས་པ་དེ་བཞིན་དུ་མཐོང་སྟེ།
en: They will think, ‘The Thus-Gone One does not come from and does not go anywhere. The cause of the bodies present in all the three realms is only the mind. I perceive things in the way I imagine them.

source: བདག་གིས་རང་གི་སེམས་ཀྱི་ཁ་དོག་ཐ་དད་པ་དང་། གཟུགས་ཐ་དད་པ་དང་། རྫུ་འཕྲུལ་ཐ་དད་པ་རྣམ་པ་སྣ་ཚོགས་པ་མཐོང་ངོ་།
en: I perceive the various different colors, forms, and magical displays of my own mind.

source: །བདག་གི་སེམས་ནི་གཟུགས་ཐ་དད་པ་དང་། རྫུ་འཕྲུལ་ཐ་དད་པ་དང་། ཁ་དོག་ཐ་དད་པ་དང་། འཇུག་པ་ཐ་དད་པ་དང་། རྣམ་པར་རྟོག་པ་ཐ་དད་པའོ། །སེམས་ནི་སྣ་ཚོགས་སུ་གྲུབ་པའོ།
en: My mind consists of different forms, magical displays, colors, cognitions, and concepts—it manifests in a variety of ways.

source: །སེམས་ནི་ནམ་མཁར་འདྲེས་པའོ།
en: The mind is mingled with space;

source: །སེམས་ནི་རླུང་དུ་ཡང་དག་པར་བརྗོད་པའོ། །རླུང་ཐམས་ཅད་ཀྱང་དངོས་པོ་མེད་པའོ་སྙམ་སྟེ། འདི་ནི་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་བའི་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཀྱི་དོན་ཡིན་ཏེ། གང་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་གིས་ང་ལ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོའི་ལག་ནས་བསྐུར་བ་ཡིན་ནོ།
en: it is described as wind, and all winds are insubstantial.’ Such is the meaning of the dhāraṇī mantra that accords with the truth shared by ordinary beings, the dhāraṇī mantra that the thus-gone Campaka Color conferred upon me through the bodhisattva great being Quintessence of the Sun’s Energy.

source: །དེ་ལ་སོ་སོའི་སྐྱེ་བོ་དང་ཐུན་མོང་མ་ཡིན་པའི་བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཀྱི་དོན་གང་ཞེ་ན།
en: “What is the meaning of the dhāraṇī mantra that accords with the truth unshared by ordinary beings?

source: དེ་ནི་གཟུགས་ཀྱི་འདོད་ཆགས་དང་དབྱིབས་ཀྱི་འདོད་ཆགས་སྤངས་པའོ། །
en: It is the abandonment of the attachment to form and shape.

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། ནམ་མཁའ་འདི་ནི་གཟུང་དུ་མེད་ཅིང་བརྗོད་དུ་མེད་པའོ།
en: Some will think, ‘Space is inapprehensible and inexpressible.

source: །དེ་བཞིན་དུ་སེམས་ཀྱང་བརྗོད་དུ་མེད་པ་སྟེ། གཉི་ག་ཡང་བརྗོད་དུ་མེད་པའོ། །
en: In the same way, the mind is also inexpressible—both are inexpressible.

source: ཕུང་པོ་འདི་དག་ནི་ཡོངས་སུ་གདུང་བ་དང་བཅས། འཁྲུག་པ་དང་བཅས། འདྲིད་པ་དང་བཅས། སླུ་བ་དང་བཅས་པ་ཡིན་པས་མ་ལ་བདག་གིས་རྣམ་པ་ཐམས་ཅད་དུ་ཀུན་ཏུ་རྟོག་པའི་སེམས་སྤངས་ན། གང་ནམ་མཁའ་ཡང་སྤངས་པར་འགྱུར་ཞིང་། རྟོག་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་བྱུང་བའི་དཔྱོད་པ་ཡང་སྤངས་པར་འགྱུར་གོར་མ་ཆག་སྙམ་མོ། །འོན་ཀྱང་དེ་སེམས་དང་པོས་ནམ་མཁའ་ལ་དམིགས་ནས། དེ་ཡང་མངོན་པར་རིག་པར་བྱ་སྟེ། རྣམ་པར་རིག་པ་ཐམས་ཅད་སྤངས་ཤིང་སྐྱེད་པར་ཡང་མི་བྱེད་དོ།
en: These aggregates are accompanied by torment, anxiety, delusion, and deception, so if I now fully abandon the conceptual mind, there is no doubt that space will be abandoned, as will all discursiveness that arises on the basis of concepts!’ However, they should know this by observing space through the first instant of their mind, so that all cognitions are interrupted and none are generated.

source: །སེམས་སྐྱེད་པ་འགག་ལ་དེའི་མ་སྐྱེས་པ་ཡང་སྐྱེད་པར་མི་བྱེད་དོ།
en: Mental productions will then cease, and those that have not yet arisen will not be produced.
